#2. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
#   Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.
#   Объяснить полученный результат.
a=5
b=6
print(f'{a} AND {b} = {a&b}')
# 5 = 0 0 0 0 1 0 1
# 6 = 0 0 0 0 1 1 0
# AND 0 0 0 0 1 0 0 (4)

print(f'{a} OR {b} = {a|b}')
# 5 = 0 0 0 0 1 0 1
# 6 = 0 0 0 0 1 1 0
# OR  0 0 0 0 1 1 1 (7)

print(f'{a} XOR {b} = {a^b}')
# 5 = 0 0 0 0 1 0 1
# 6 = 0 0 0 0 1 1 0
# XOR 0 0 0 0 0 1 1 (3)

print(f'NOT {a} = {~a}')
# 5 = 0 0 0 0 1 0 1
# NOT 1..1 1 1 1 0 1 0 (-6)

print(f'{a} RIGHT SHIFT 2 = {a>>2}')
# 5 =  0 0 0 0 1 0 1
# a>>2 0 0 0 0 0 0 1 (1)

print(f'{a} LEFT SHIFT 2 = {a<<2}')
# 5 =  0 0 0 0 1 0 1
# a<<2 0 0 1 0 1 0 0 (20)